#afin de pouvoir traiter les arguments du terminal
import sys


Hiragana = {
    "あ" : "a",  "い" : "i",  "う" : "u",  "え" : "e",  "お" : "o",
    "か" : "ka", "き" : "ki", "く" : "ku", "け" : "ke", "こ" : "ko",
    "が" : "ga", "ぎ" : "gi", "ぐ" : "gu", "げ" : "ge", "ご" : "go",
    "さ" : "sa", "し" : "si", "す" : "su", "せ" : "se", "そ" : "so",
    "ざ" : "za", "じ" : "zi", "ず" : "zu", "ぜ" : "ze", "ぞ" : "zo",
    "た" : "ta", "ち" : "chi", "つ" : "tsu", "て" : "te", "と" : "to", 
    "だ" : "da", "ぢ" : "di", "づ" : "du", "で" : "de", "ど" : "do", 
    "な" : "na", "に" : "ni", "ぬ" : "nu", "ね" : "ne", "の" : "no",
    "は" : "ha", "ひ" : "hi", "ふ" : "hu", "へ" : "he", "ほ" : "ho",
    "ば" : "ba", "び" : "bi", "ぶ" : "bu", "べ" : "be", "ぼ" : "bo", 
    "ぱ" : "pa", "ぴ" : "pi", "ぷ" : "pu", "ぺ" : "pe", "ぽ" : "po", 
    "ま" : "ma", "み" : "mi", "む" : "mu", "め" : "me", "も" : "mo", 
    "や" : "ya",             "ゆ" : "yu", "𛀁" : "ye", "よ" : "yo", 
    "ら" : "ra", "り" : "ri", "る" : "ru", "れ" : "re", "ろ" : "ro", 
    "わ" : "wa", "ゐ" : "wi",              "ゑ" : "we", "を" : "wo",
    "ん" : "n", "っ" : "k", "て" : "te" 
}

Katakana = {
    "ア" : "a",  "イ" : "i",  "ウ" : "u",  "エ" : "e",  "オ" : "o",
    "カ" : "ka", "キ" : "ki", "ク" : "ku", "ケ" : "ke", "コ" : "ko",
    "ガ" : "ga", "ギ" : "gi", "グ" : "gu", "ゲ" : "ge", "ゴ" : "go",
    "サ" : "sa", "シ" : "si", "ス" : "su", "セ" : "se", "ソ" : "so",
    "ザ" : "za", "ジ" : "zi", "ズ" : "zu", "ゼ" : "ze", "ゾ" : "zo",
    "タ" : "ta", "チ" : "chi", "ツ" : "tsu", "テ" : "te", "ト" : "to", 
    "ダ" : "da", "ヂ" : "di", "ヅ" : "du", "デ" : "de", "ド" : "do", 
    "ナ" : "na", "ニ" : "ni", "ヌ" : "nu", "ネ" : "ne", "ノ" : "no",
    "ハ" : "ha", "ヒ" : "hi", "フ" : "hu", "ヘ" : "he", "ホ" : "ho", 
    "バ" : "ba", "ビ" : "bi", "ブ" : "bu", "ベ" : "be", "ボ" : "bo", 
    "パ" : "pa", "ピ" : "pi", "プ" : "pu", "ペ" : "pe", "ポ" : "po", 
    "マ" : "ma", "ミ" : "mi", "ム" : "mu", "メ" : "me", "モ" : "mo", 
    "ヤ" : "ya ",             "ユ" : "yu", "𛀀" : "ye", "ヨ" : "yo", 
    "ラ" : "ra", "リ" : "ri", "ル" : "ru", "レ" : "re", "ロ" : "ro", 
    "ワ" : "wa", "ヰ" : "wi",              "ヱ" : "we", "ヲ" : "wo",
    "ン" : "n", "ッ" : "k", "テ" : "te"
}

Diagraph = {

    # ===========================| katakana |==========================
    "キャ" : "ε", "キュ" : "ю", "キョ" : "έ", "キィ" : "ж", "キァ" : "═",
    "シャ" : "β", "シュ" : "χ", "ショ" : "ὲ", "シィ" : "џ", "シァ" : "║",
    "チャ" : "α", "チュ" : "ψ", "チョ" : "ά", "チィ" : "њ", "チァ" : "╒",
    "ニャ" : "γ", "ニュ" : "ω", "ニョ" : "ὰ", "ニィ" : "љ", "ニァ" : "╓",
    "ヒャ" : "д", "ヒュ" : "ρ", "ヒョ" : "ώ", "ヒィ" : "є", "ヒァ" : "╔",
    "ミャ" : "ζ", "ミュ" : "ς", "ミョ" : "ύ", "ミィ" : "ѓ", "ミァ" : "╕",
    "リャ" : "η", "リュ" : "π", "リョ" : "ό", "リィ" : "ђ", "リァ" : "╖",
    "ギャ" : "μ", "ギュ" : "Σ", "ギョ" : "ϋ", "ギィ" : "э", "ギァ" : "╗",
    "ジャ" : "ι", "ジュ" : "Φ", "ジョ" : "ϊ", "ジィ" : "҂", "ジァ" : "╘",
    "ヂャ" : "ι", "ヂュ" : "Φ", "ヂョ" : "ϊ", "ヂィ" : "Ҥ", "ヂァ" : "╙",
    "ビャ" : "κ", "ビュ" : "Ξ", "ビョ" : "Δ", "ビィ" : "п", "ビァ" : "╚",
    "ピャ" : "ш", "ピュ" : "Λ", "ピョ" : "Θ", "ピィ" : "Ӹ", "ピァ" : "╛",
    "テャ" : "∌", "テュ" :"∬", "テョ" : "∦", "ティ" : "⊕", "テァ" : "╜",
    "フャ" : "Æ", "フュ" :"Þ", "フョ" : "§", "フィ" : "¬", "ファ" : "¶",


    # ==========================| Hiragana | ==========================
    "きゃ" : "ε", "きゅ" : "ю", "きょ" : "έ", "きぃ" : "ж", "きぁ" : "═",
    "しゃ" : "β", "しゅ" : "χ", "しょ" : "ὲ", "しぃ" : "џ", "しぁ" : "║",
    "ちゃ" : "α", "ちゅ" : "ψ", "ちょ" : "ά", "ちぃ" : "њ", "ちぁ" : "╒",
    "にゃ" : "γ", "にゅ" : "ω", "にょ" : "ὰ", "にぃ" : "љ", "にぁ" : "╓",
    "ひゃ" : "д", "ひゅ" : "ρ", "ひょ" : "ώ", "ひぃ" : "є", "ひぁ" : "╔",
    "みゃ" : "ζ", "みゅ" : "ς", "みょ" : "ύ", "みぃ" : "ѓ", "みぁ" : "╕",
    "りゃ" : "η", "りゅ" : "π", "りょ" : "ό", "りぃ" : "ђ", "りぁ" : "╖",
    "ぎゃ" : "μ", "ぎゅ" : "Σ", "ぎょ" : "ϋ", "ぎぃ" : "э", "ぎぁ" : "╗",
    "じゃ" : "ι", "じゅ" : "Φ", "じょ" : "ϊ", "じぃ" : "҂", "じぁ" : "╘",
    "ぢゃ" : "ι", "ぢゅ" : "Φ", "ぢょ" : "ϊ", "ぢぃ" : "҂", "ぢぁ" : "╘",
    "びゃ" : "κ", "びゅ" : "Ξ", "びょ" : "Δ", "びぃ" : "п", "びぁ" : "╚",
    "ぴゃ" : "ш", "ぴゅ" : "Λ", "ぴょ" : "Θ", "ぴぃ" : "Ӹ", "ぴぁ" : "╛",
    "てゃ" : "∌", "てゅ" : "∬", "てょ" : "∦", "てぃ" : "⊕", "てぁ" : "╜",
    "ふゃ" : "Æ", "ふゅ" : "Þ", "ふょ" : "§", "ふぃ" : "¬", "ふぁ" : "¶"
}


noteSkeleton = {
    "ε" : "kya", "ю" : "kyu", "έ" : "kyo", "ж" : "ki" , "═" : "kia",
    "β" : "sha", "χ" : "shu", "ὲ" : "sho", "џ" : "shi", "║" : "shia",
    "α" : "cha", "ψ" : "chi", "ά" : "cho", "њ" : "chi", "╒" : "chia",
    "γ" : "nya", "ω" : "nyu", "ὰ" : "nyo", "љ" : "ni" , "╓" : "nia",
    "д" : "hya", "ρ" : "hyu", "ώ" : "hyo", "є" : "hi" , "╔" : "hia",
    "ζ" : "mya", "ς" : "myu", "ύ" : "myo", "ѓ" : "mi" , "╕" : "mia",
    "η" : "rya", "π" : "ryu", "ό" : "ryo", "ђ" : "ri" , "╖" : "ria",
    "μ" : "gya", "Σ" : "gyu", "ϋ" : "gyo", "э" : "gi" , "╗" : "gia",
    "ι" : "ja" , "Φ" : "ju" , "ϊ" : "jo" , "҂" : "ji" , "╘" : "jia",
    "κ" : "bya", "Ξ" : "byu", "Δ" : "byo", "п" : "bi" , "╚" : "bia",
    "ш" : "pya", "Λ" : "pyu", "Θ" : "pyo", "Ӹ" : "pi" , "╛" : "pia",
    "∌" : "tya", "∬" : "tyu", "∦" : "tyo", "⊕" : "ti", "╜" : "tea",
    "Æ" : "fa", "Þ" : "fu", "§" : "fo", "¬" : "fi", "¶" : "fa"
}

loopindex = 0

# =====| main portion of the code |=====
if (len(sys.argv) >= 2):
    for index in range(1, len(sys.argv)):
        txt = str(sys.argv[index])
        for x in Diagraph:
            if (x in txt):
                txt = txt.replace(x, Diagraph[x])
        for Sy in txt:
            try:
                try:
                    print(Hiragana[Sy], end='')
                except:
                    try:
                        print(Katakana[Sy], end='')
                    except:
                        print(noteSkeleton[Sy], end='')
            except:
                if Sy != 'ー':
                    print(Sy, end='')
                for ss in noteSkeleton:
                    if (Sy == noteSkeleton[ss]):
                        print(ss, end='')
        print(" ", end='')
else:
    print("no arguments enough")

print()
# ======================================
